<?php

return [
    'orders'    => [
        'emails'        => [
            'admins'    => [
                'header'        => 'تم استلام طلب جديد',
                'open_order'    => 'رابط الطلب',
                'subject'       => 'طلب جديد',
            ],
            'users'     => [
                'header'        => 'شكرا لطلبك من خلال موقع دفتر ، انتطر التواصل معك في اقرب وقت',
                'open_order'    => 'تفاصيل الطلب',
                'rate_order'    => 'تقيم الطلب',
                'subject'       => 'طلب جديد - موقع دفتر',
            ],
            'vendors'   => [
                'header'        => 'تم استلام طلب جديد',
                'open_order'    => 'رابط الطلب',
                'subject'       => 'طلب جديد',
            ],
        ],
        'index'         => [
            'alerts'    => [
                'order_failed'  => 'فشلت عملية الدفع حاول مره اخرى.',
                'order_success' => 'شكرا لطلبك من موقع دفتر ، سيتم التواصل معكم في اقرب وقت',
            ],
            'btn'       => [
                'details'   => 'تفاصيل الطلب',
            ],
            'title'     => 'طلباتي',
        ],
        'invoice'       => [
            'address'       => 'العنوان',
            'block'         => 'القطعة',
            'btn'           => [
                'print'     => 'طباعة',
                'reorder'   => 'اعادة الطلب',
            ],
            'building'      => 'المبنى / البيت',
            'date'          => 'التاريخ',
            'details'       => 'تفاصيل العنوان',
            'email'         => 'البريد',
            'method'        => 'طريقة الدفع',
            'mobile'        => 'رقم هاتف',
            'product_qty'   => 'الكمية',
            'product_title' => 'المنتج',
            'product_total' => 'المجموع',
            'shipping'      => 'التوصيل',
            'street'        => 'الشارع',
            'subtotal'      => 'المجموع',
            'title'         => 'الفاتوره',
            'total'         => 'المجموع الكلي',
            'username'      => 'الاسم',
        ],
        'validations'   => [
            'address'   => [
                'min'       => 'من فضلك ادخل تفاصيل اكثر ، يجب الا يقل العنوان عن ١٠ احرف',
                'required'  => 'من فضلك ادخل تفاصيل الطلب',
                'string'    => 'من فضلك ادخل تفاصيل العنوان حروف و ارقام فقط',
            ],
            'block'     => [
                'required'  => 'من فضلك ادخل القطعة',
                'string'    => 'من فضلك ادخل القطعة ارقام و احرف فقط',
            ],
            'building'  => [
                'required'  => 'من فضلك ادخل البناية',
                'string'    => 'من فضلك ادخل البناية ارقام و احرف فقط',
            ],
            'date'      => [
                'required'  => 'من فضلك اختر تاريخ الطلب',
            ],
            'email'     => [
                'email'     => 'من فضلك ادخل البريد الالكتروني بشكل صحيح',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'mobile'    => [
                'digits_between'    => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric'           => 'من فضلك ادخل رقم الموبيل ارقام انجليزية فقط',
                'required'          => 'من فضلك ادخل رقم الموبيل',
            ],
            'payment'   => [
                'required'  => 'من فضلك اختر طريقة الدفع',
            ],
            'state'     => [
                'numeric'   => 'من فضلك اختر المنطقة',
                'required'  => 'من فضلك اختر المنطقة',
            ],
            'street'    => [
                'required'  => 'من فضلك ادخل اسم / رقم الشارع',
                'string'    => 'من فضلك ادخل الشارع ارقام و احرف فقط',
            ],
            'time'      => [
                'required'  => 'من فضلك اختر وقت التوصيل',
            ],
            'username'  => [
                'min'       => 'من فضلك ادخل اسم المستخدم ولا يقل عن حرفين',
                'required'  => 'من فضلك ادخل اسم المستخدم',
                'string'    => 'من فضلك ادخل اسم المستخدم حروف و ارقام فقط',
            ],
        ],
    ],
];
