<?php

return [
    'popup_adds' => [
        'datatable' => [
            'created_at' => 'تاريخ الآنشاء',
            'date_range' => 'البحث بالتواريخ',
            'end_at' => 'الانتهاء في',
            'image' => 'الصورة',
            'link' => 'الرابط',
            'options' => 'الخيارات',
            'start_at' => 'يبدأ في',
            'status' => 'الحاله',
            'type' => 'النوع',
        ],
        'form' => [
            'end_at' => 'الانتهاء في',
            'image' => 'الصورة',
            'link' => 'رابط الإعلان',
            'start_at' => 'يبدأ في',
            'status' => 'الحاله',
            'sort' => 'الترتيب',
            'title' => 'العنوان',
            'short_description' => 'الوصف المختصر',
            'tabs' => [
                'general' => 'بيانات عامة',
            ],
            'products' => 'المنتجات',
            'categories' => 'أقسام المنتجات',
            'vendors' => 'متاجر',
            'brands' => 'العلامات التجارية',
            'popup_adds_type' => [
                'label' => 'نوع الإعلان',
                'external' => 'خارجى',
                'product' => 'منتجات',
                'category' => 'أقسام منتجات',
                'vendor' => 'متجر',
                'brand' => 'علامة تجارية',
            ],
        ],
        'alert' => [
            'select_vendor' => 'اختر المتجر',
            'select_categories' => 'اختر قسم المنتجات',
            'select_products' => 'اختر المنتج',
            'select_brand' => 'اختر العلامة التجارية',
        ],
        'routes' => [
            'create' => 'اضافة إعلانات منبثقة',
            'index' => 'الإعلانات المنبثقة',
            'update' => 'تعديل إعلانات منبثقة',
        ],
        'validation' => [
            'end_at' => [
                'required' => 'من فضلك اختر تاريخ الانتهاء',
            ],
            'image' => [
                'required' => 'من فضلك اختر صورة الإعلان',
            ],
            'link' => [
                'required' => 'من فضلك ادخل رابط الإعلان',
                'required_if' => 'من فضلك ادخل رابط الإعلان',
            ],
            'start_at' => [
                'required' => 'من فضلك اختر تاريخ البدء',
            ],
            'title' => [
                'required' => 'من فضلك ادخل عنوان الإعلان',
            ],
            'popup_adds_type' => [
                'required' => 'من فضلك اختر نوع الإعلان',
                'in' => 'نوع الإعلان يجب ان يكون ضمن القيم الآتيه',
            ],
            'product_id' => [
                'required_if' => 'من فضلك اختر المنتج',
                'exists' => 'منتج الاعلان غير موجود حاليا',
            ],
            'category_id' => [
                'required_if' => 'من فضلك اختر القسم',
                'exists' => 'قسم منتج الاعلان غير موجود حاليا',
            ],
            'brand_id' => [
                'required' => 'من فضلك اختر العلامة التجارية',
                'exists' => 'العلامة التجارية غير موجودة حاليا',
            ],
            'vendor_id' => [
                'required_if' => 'من فضلك اختر المتجر',
                'exists' => 'المتجر غير موجود حاليا',
            ],
        ],
    ],
];
