<?php

return [
    'address'   => [
        'btn'           => [
            'add'           => 'اضافة عنوان',
            'add_modal'     => 'اضافة عنوان جديد',
            'go_to_payment' => 'استكمال الطلب',
        ],
        'form'          => [
            'address_details'   => 'تفاصيل العنوان',
            'as_guest'          => 'استكمال كزائر',
            'as_member'         => 'استكمال كعضو',
            'block'             => 'رقم القطعة',
            'building'          => 'رقم البناية',
            'email'             => 'البريد',
            'login'             => 'تسجيل دخول',
            'mobile'            => 'الموبيل',
            'register'          => 'تسجيل كعضو جديد',
            'states'            => 'اختر المنطقة',
            'street'            => 'الشارع',
            'username'          => 'الاسم',
        ],
        'index'         => [
            'subtotal'  => 'المجموع',
        ],
        'list'          => [
            'address_details'   => 'تفاصيل العنوان',
            'block'             => 'القطعة',
            'mobile'            => 'الهاتف',
            'state'             => 'المنطقة',
            'street'            => 'الشارع',
        ],
        'title'         => 'عنوان الطلب',
        'validation'    => [
            'address'   => [
                'numeric'   => 'من فضلك اختر عنوان التوصيل',
                'required'  => 'من فضلك اختر عنوان التوصيل',
            ],
        ],
    ],
    'addresses' => [
        'form'  => [
            'kuwait'    => 'الكويت',
        ],
    ],
    'cart'      => [
        'add_succesfully'   => 'تم اضافة المنتج بنجاح داخل عربة التسوق',
        'btn'               => [
            'continue'              => 'استكمال التسوق',
            'got_to_shopping_cart'  => 'الذهاب الى عربة التسوق',
        ],
        'cart_updated'      => 'تم طلبك بنجاح داخل عربة التسوق',
        'clear'             => 'حذف الكل',
        'clear_cart'        => 'تم تفريغ عربة التسوق بنجاح',
        'delete_item'       => 'تم حذف المنتج من عربة التسوق',
        'empty'             => 'لا يوجد منتجات في عربة التسوق',
        'error_in_cart'     => 'حدث خطا ما ، من فضلك حاول مره اخرى',
        'go_to_checkout'    => 'استكمال الطلب',
        'shipping'          => 'التوصيل',
        'subtotal'          => 'المجموع',
        'title'             => 'عربة التسوق',
        'total'             => 'المجموع الكلي',
    ],
    'checkout'  => [
        'address'           => [
            'btn'       => [
                'add'       => 'اضافة عنوان',
                'add_modal' => 'اضافة عنوان جديد',
            ],
            'details'   => [
                'address'   => 'تفاصيل العنوان',
                'block'     => 'القطعة',
                'mobile'    => 'الهاتف',
                'state'     => 'المنطقة',
                'street'    => 'الشارع',
            ],
            'form'      => [
                'address_details'   => 'تفاصيل العنوان',
                'block'             => 'رقم القطعة',
                'building'          => 'رقم البناية',
                'email'             => 'البريد',
                'mobile'            => 'الموبيل',
                'states'            => 'اختر المنطقة',
                'street'            => 'الشارع',
                'username'          => 'الاسم',
            ],
            'title'     => 'عنوان الطلب',
        ],
        'coupon_discount'   => 'الكوبون',
        'delivery_message'  => 'نظراً للظروف الحالية سيكون التوصيل خلال ٤٨ ساعة',
        'form'              => [
            'date'  => 'اختر تاريخ التوصيل',
            'time'  => 'وقت التوصيل',
            'time_from'  => 'من',
            'time_to'  => 'الى',
        ],
        'index'             => [
            'go_to_payment' => 'اتمام الطلب الآن',
            'payments'      => 'اختر طريقة الدفع',
            'title'         => 'اتمام الطلب',
        ],
        'shipping'          => 'التوصيل',
        'subtotal'          => 'المجموع',
        'title'             => 'الدفع',
        'total'             => 'السعر الكلي',
        'validation'        => [
            'order_limit'   => 'نعتذر لك لعدم اتمام الدفع ، يجب الا يقل الطلب من هذا المتجر عن :',
        ],
    ],
    'favorites' => [
        'add_succesfully'   => 'تم اضافة المنتج في قائمة المفضلة',
        'btn'               => [
            'continue'              => 'استكمال',
            'got_to_favorite_list'  => 'الذهاب لقائمة المفضلة',
        ],
        'clear'             => 'حذف الكل',
        'title'             => 'قائمة المفضلة',
    ],
    'products'  => [
        'add_notes' => 'اضافة ملاحظه',
        'notes'     => 'ملاحظه ',
        'alerts'            => [
            'product_qty_less_zero' => 'نعتذر هذا المنتج اصبح حاليا غير متاح ، حاول لاحقا',
            'qty_is_not_active'     => 'المنتج غير متوفر الان',
            'qty_more_than_max'     => 'نعتذر لكن لا يمكنك طلب كمية اكثر من :',
            'time_date_not_accepted' => 'لا يمكننا استقبال الطلب في هذا الموعد المختار ، من فضلك اختر تاريخ او موعد اخر',
            'vendor_not_match'      => 'لا يمكن اضافة هذا المنتج قبل حذف جميع منتجات المتجر الاخر.',
        ],
        'description'       => 'تفاصيل المنتج',
        'form'              => [
            'option'    => 'اختر',
        ],
        'price'             => 'سعر المنتج',
        'related_products'  => 'منتجات ذات صلة',
        'sku'               => 'كود المنتج',
        'validation'        => [
            'option_value'  => [
                'required'  => 'من فضلك اختر',
            ],
            'qty'           => [
                'numeric'   => 'من فضلك ادخل الكمية ارقام انجيليزية فقط',
                'required'  => 'من فضلك ادخل كمية المنتج المرادة',
            ],
        ],
    ],
    'search'    => [
        'index' => [
            'empty' => 'لا يوجد منتجات او متاجر لكلمة البحث الخاصة بك',
            'title' => 'نتائج البحث',
        ],
    ],
];
