<?php

return [
    'addresses' => [
        'btn'           => [
            'edit'  => 'تعديل العنوان',
        ],
        'edit'          => [
            'title' => 'تعديل العنوان',
        ],
        'form'          => [
            'address_details'   => 'تفاصيل العنوان',
            'block'             => 'رقم القطعة',
            'building'          => 'رقم البناية',
            'email'             => 'البريد',
            'kuwait'            => 'الكويت',
            'mobile'            => 'الموبيل',
            'states'            => 'اختر المنطقة',
            'street'            => 'الشارع',
            'username'          => 'اسم المستخدم',
        ],
        'index'         => [
            'alert' => [
                'error'     => 'حدث خطا ما ، حاول مره اخرى',
                'success'   => 'تم تعديل العنوان بنجاح',
                'success_'  => 'تم اضافة العنوان بنجاح',
            ],
            'btn'   => [
                'add'       => 'اضافة عنوان جديد',
                'delete'    => 'حذف',
                'edit'      => 'تعديل',
            ],
            'title' => 'العناوين السابقة',
        ],
        'validations'   => [
            'address'   => [
                'min'       => 'من فضلك ادخل تفاصيل اكثر ، يجب الا يقل العنوان عن ١٠ احرف',
                'required'  => 'من فضلك ادخل تفاصيل الطلب',
                'string'    => 'من فضلك ادخل تفاصيل العنوان حروف و ارقام فقط',
            ],
            'block'     => [
                'required'  => 'من فضلك ادخل القطعة',
                'string'    => 'من فضلك ادخل القطعة ارقام و احرف فقط',
            ],
            'building'  => [
                'required'  => 'من فضلك ادخل البناية',
                'string'    => 'من فضلك ادخل البناية ارقام و احرف فقط',
            ],
            'email'     => [
                'email'     => 'من فضلك ادخل البريد الالكتروني بشكل صحيح',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'mobile'    => [
                'digits_between'    => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric'           => 'من فضلك ادخل رقم الموبيل ارقام انجليزية فقط',
                'required'          => 'من فضلك ادخل رقم الموبيل',
            ],
            'state'     => [
                'numeric'   => 'من فضلك اختر المنطقة',
                'required'  => 'من فضلك اختر المنطقة',
            ],
            'street'    => [
                'required'  => 'من فضلك ادخل اسم / رقم الشارع',
                'string'    => 'من فضلك ادخل الشارع ارقام و احرف فقط',
            ],
            'username'  => [
                'min'       => 'من فضلك ادخل اسم المستخدم ولا يقل عن حرفين',
                'required'  => 'من فضلك ادخل اسم المستخدم',
                'string'    => 'من فضلك ادخل اسم المستخدم حروف و ارقام فقط',
            ],
        ],
    ],
    'profile'   => [
        'index' => [
            'favorites' => 'المفضلة',
            'addresses' => 'العناوين',
            'alert'     => [
                'error'     => 'Opss! something wrong please try again later',
                'success'   => 'تم تعديل الملف الشخصي بنجاح',
            ],
            'form'      => [
                'btn'                   => [
                    'update'    => 'تعديل',
                ],
                'current_password'      => 'كلمة المرور الحالية',
                'email'                 => 'البريد الالكتروني',
                'mobile'                => 'رقم الهاتف',
                'name'                  => 'الاسم الشخصي',
                'password'              => 'كلمة المرور جديدة',
                'password_confirmation' => 'تآكيد كلمة المرور',
            ],
            'logout'    => 'تسجيل خروج',
            'orders'    => 'طلباتي',
            'title'     => 'الملف الشخصي',
            'update'    => 'تعديل الحساب',
            'validation'=> [
                'current_password'  => [
                    'not_matchh'    => 'كلمة المرور الحالية غير صحيحة',
                    'required_with' => 'من فضلك ادخل كلمة المرور الحالية',
                ],
                'email'             => [
                    'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                    'required'  => 'من فضلك ادخل البريد الالكتروني',
                    'unique'    => 'هذا البريد الالكتروني تم حجزة من قبل شخص اخر',
                ],
                'mobile'            => [
                    'numeric'   => 'من فضلك ادخل رقم الهاتف من ارقام انجليزية فقط',
                    'required'  => 'من فضلك ادخل رقم الهاتف',
                    'unique'    => 'رقم الهاتف تم حجزه من قبل شخص اخر',
                ],
                'name'              => [
                    'required'  => 'من فضلك ادخل الاسم الشخصي',
                ],
                'password'          => [
                    'confirmed'     => 'كلمة المرور غير متطابقة مع التآكيد',
                    'min'           => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                    'required'      => 'يجب ان تدخل كلمة المرور',
                    'required_with' => 'من فضلك ادخل كلمة المرور الجديدة',
                ],
            ],
        ],
    ],
];
