<?php

return [
    'login'     => [
        'form'          => [
            'btn'           => [
                'forget_password'   => 'فقدت كلمة المرور؟',
                'login'             => 'تسجيل الدخول',
            ],
            'email'         => 'البريد الالكتروني',
            'password'      => 'كلمة المرور',
            'remember_me'   => 'تذكرني',
        ],
        'title'         => 'تسجيل الدخول',
        'validation'    => [
            'email'     => [
                'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'failed'    => 'هذه البيانات غير متطابقة لدينا من فضلك تآكد من بيانات تسجيل الدخول',
            'password'  => [
                'min'       => 'كلمة المرور يجب ان تكون اكثر من ٦ مدخلات',
                'required'  => 'يجب ان تدخل كلمة المرور',
            ],
        ],
    ],
    'password'  => [
        'alert'         => [
            'reset_sent'    => 'تم ارسال بريد بتعين كلمة مرور جديدة',
        ],
        'form'          => [
            'btn'   => [
                'password'  => 'ارسال تعين كلمة المرور',
            ],
            'email' => 'البريد الالكتروني',
        ],
        'title'         => 'فقدان كلمة المرور',
        'validation'    => [
            'email' => [
                'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                'exists'    => 'هذا البريد غير موجود لدينا',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
        ],
    ],
    'register'  => [
        'alert'         => [
            'policy_privacy'    => 'من خلال التسجيل قد وافقت على',
        ],
        'btn'           => [
            'policy_privacy'    => 'الشروط و الاحكام',
            'register'          => 'تسجيل مستخدم جديد',
        ],
        'form'          => [
            'email'                 => 'البريد الالكتروني',
            'mobile'                => 'رقم الهاتف',
            'name'                  => 'اسم المستخدم',
            'password'              => 'كلمة المرور',
            'password_confirmation' => 'تآكيد كلمة المرور',
        ],
        'title'         => 'تسجيل مستخدم جديد',
        'validation'    => [
            'email'     => [
                'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد الالكتروني تم حجزة من قبل شخص اخر',
            ],
            'mobile'    => [
                'digits_between'    => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric'           => 'من فضلك ادخل رقم الهاتف من ارقام انجليزية فقط',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم حجزه من قبل شخص اخر',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'confirmed' => 'كلمة المرور غير متطابقة مع التآكيد',
                'min'       => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required'  => 'يجب ان تدخل كلمة المرور',
            ],
        ],
    ],
    'reset'     => [
        'form'          => [
            'btn'                   => [
                'reset' => 'تعيمن كلمة المرورالآن',
            ],
            'email'                 => 'البريد الالكتروني',
            'password'              => 'كلمة المرور',
            'password_confirmation' => 'تآكيد كلمة المرور',
        ],
        'mail'          => [
            'button_content'    => 'تعين كلمة مرور جديدة',
            'header'            => 'انت تستقبل هذا البريد الالكتروني لآنك قمت بطلب تعين كلمة مرور جديدة لفقدانك القديمة',
            'subject'           => 'تعين كلمة مرور جديدة',
        ],
        'title'         => 'تعين كلمة مرور جديدة',
        'validation'    => [
            'email'     => [
                'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                'exists'    => 'هذا البريد غير موجود لدينا',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'password'  => [
                'min'       => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required'  => 'يجب ان تدخل كلمة المرور',
            ],
            'token'     => [
                'exists'    => 'انتهت صلاحية هذا الطلب',
                'required'  => 'لا تملك صلاحية تعين كلمة مرور جديدة قم بعمل طلب جديد',
            ],
        ],
    ],
];
