<?php

return [
    'contact_us'    => [
        'alerts'        => [
            'rate_message'  => 'تم التقيم بنجاح',
            'send_message'  => 'تم ارسال الرسالة بنجاح',
        ],
        'form'          => [
            'btn'       => [
                'send'  => 'ارسال',
            ],
            'email'     => 'البريد الالكتروني',
            'message'   => 'الرسالة',
            'mobile'    => 'الهاتف',
            'username'  => 'اسم المستخدم',
        ],
        'info'          => [
            'email' => 'البريد الالكتروني',
            'mobile'=> 'الهاتف',
            'title' => 'بيانات التواصل',
        ],
        'mail'          => [
            'header'    => 'لقد استقبلنا رسالة تواصل معنا جديدة من احد الزوار',
            'subject'   => 'تواصل معانا',
        ],
        'title'         => 'تواصل معانا',
        'title_2'       => 'ارسل لنا رسالة لنتواصل معك',
        'validations'   => [
            'email'     => [
                'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'message'   => [
                'min'       => 'يجب الا تقل الرسالة عن ١٠ احرف',
                'required'  => 'من فضلك ادخل الرسالة النصية',
                'string'    => 'من فضلك ادخل الرسالة النصية ارقام و حروف فقط',
            ],
            'mobile'    => [
                'digits_between'    => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric'           => 'من فضلك ادخل رقم الهاتف ارقام فقط',
                'required'          => 'من فضلك ادخل رقم الهاتف',
            ],
            'username'  => [
                'min'       => 'يجب الا يقل اسم المستخدم عن ٣ احرف',
                'required'  => 'من فضلك ادخل اسم المستخدم',
                'string'    => 'يجب ان يتكون اسم المستخدم من احرف و ارقام فقط',
            ],
        ],
    ],
    'footer'        => [
        'tocaan'        => 'شركة توكان',
        'developed_by'  => 'تصميم و برمجة',
        'contact_us'    => 'تواصل معنا',
        'helper_links'  => 'روابط مساعدة',
        'home_page'     => 'الرئيسية',
        'payments'      => 'طرق الدفع',
        'site_map'      => 'خريطة الموقع',
        'whatsapp'      => 'واتس اب',
    ],
    'general'       => [
        'add_to_cart'       => 'اضف الى السلة',
        'kwd'               => 'د.ك',
        'update_item_cart'  => 'تحديث',
    ],
    'home'          => [
        'search_btn'    => 'بحث',
        'search_holder' => 'البحث عن متجر او منتج',
        'title'         => 'الصفحة الرئيسية',
        'view_more_btn' => 'عرض المزيد',
    ],
    'nav'           => [
        'contact_us_page'   => 'اتصل بنا',
        'home_page'         => 'الرئيسية',
        'login'             => 'تسجيل دخول',
        'register'          => 'تسجيل جديد',
    ],
];
